"""
История:
Вы собираетесь приготовить тосты быстро и считаете, что нужно приготовить несколько кусочков тостов и за один раз.
Итак, вы пытаетесь приготовить 6 кусочков тостов.

Проблема:
Вы забыли подсчитать количество тостов, которые вы кладете в тостер, и не знаете,
ровно ли шесть кусочков тостов вы положили в тостер.

Определите функцию, которая подсчитывает, сколько еще (или меньше) кусочков тостов вам нужно положить в тостер.
Даже если вам нужно больше или меньше, число все равно будет положительным, а не отрицательным.

Примеры:
Вы должны указать количество тостов, которое вам нужно положить (или вынуть).
В случае, если их 5, вы все равно можете положить 1 тост:

5 --> 1
А в случае с 12 тостами вам понадобится на 6 тостов меньше (но не на -6).:

12 --> 6
"""


def six_toast(num):
    return round(6 - num, 0) if num < 6 else num - 6

print(six_toast(5))
print(six_toast(12))