"""
Вы идёте с сыном в лес, чтобы посмотреть на обезьян. Вы знаете, что их там определённое количество (n),
но ваш сын ещё слишком мал, чтобы просто оценить их количество, ему нужно начать считать с единицы.

Как хороший родитель, вы будете сидеть и считать вместе с ним.
Учитывая число (n), заполните массив всеми числами до этого числа включительно, но без нуля.

 Например (ввод --> вывод):

10 --> [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
 1 --> [1]

"""

def monkey_count(n):
    return list(range(1, n + 1))


print(monkey_count(1))