"""
Давайте создадим систему подбора вакансий для разработчиков, которая будет учитывать ряд факторов.

Один из самых простых, но в то же время важных факторов — оплата труда.
Мы, разработчики, знаем, сколько денег нам нужно, чтобы вести привычный образ жизни, поэтому у нас, как правило,
есть примерное представление о минимальной зарплате, которая нас устроит.

Давайте попробуем.  Мы создадим функцию match (job_matching на Python), которая будет принимать данные
о кандидате и вакансии и возвращать логическое значение, указывающее, подходит ли вакансия кандидату.

У кандидата будет минимальная зарплата, поэтому его данные будут выглядеть так:

candidate = {
  'min_salary': 120000
}
У вакансии будет максимальная зарплата, поэтому её данные будут выглядеть так:

job = {
  'max_salary': 140000
}
Если минимальная зарплата кандидата или максимальная зарплата вакансии не указаны, выдайте ошибку.

Для корректного подбора вакансий минимальная зарплата кандидата должна быть меньше или равна максимальной зарплате вакансии.
Однако давайте также заложим 10% на непредвиденные обстоятельства (вычтем из минимальной зарплаты кандидата) на случай,
если кандидат окажется настоящей звездой и в свободное время любит программировать на Codewars.
Компания, предлагающая вакансию, может что-нибудь придумать.
"""

def job_matching(candidate, job):
    return candidate.get('min_salary') * 0.9 <= job.get('max_salary')