"""
Даны две строки, a и b. Верните строку вида short+long+short, где более короткая строка находится снаружи,
а более длинная — внутри. Строки могут быть разной длины, но могут быть и пустыми (нулевой длины).

Подсказка для пользователей R:

Длина строки не всегда равна количеству символов
Например: (Input1, Input2) --> output

("1", "22") --> "1221"
("22", "1") --> "1221"
"""


def short_long_short(str1, str2):
    if len(str1) < len(str2):
        return str1 + str2 + str1
    else:
        return str2 + str1 + str2
