"""
Весной цветет японская вишня, ее называют "сакура", и она вызывает всеобщее восхищение. 
Лепестки начинают опадать в конце апреля.

Предположим, что скорость падения лепестка составляет 5 сантиметров в секунду (5 см/с), 
и требуется 80 секунд, чтобы лепесток достиг земли с определенной ветки.

Напишите функцию, которая принимает скорость (в см/с) лепестка в качестве входных данных и возвращает время, 
необходимое для того, чтобы этот лепесток достиг земли с той же ветки.

Записи:

Движение лепестка довольно сложное, поэтому в данном случае мы можем рассматривать скорость его 
падения как постоянную.

Обратите внимание на типы данных.
Если начальная скорость неположительна, возвращаемое значение должно быть равно 0
"""

def sakura_fall(v):
    if v <= 0:
        return 0
    
    # Высота ветки = скорость * время = 5 * 80 = 400 см
    height = 5 * 80  # 400 см
    
    # Время = расстояние / скорость
    return height / v


print(sakura_fall(-1))