"""
Напишите метод, который будет получать в качестве параметра массив целых чисел и обрабатывать каждое число из этого массива.
Верните новый массив, в котором каждое число из исходного массива будет обработано следующим образом:
Если у числа есть целочисленный квадратный корень, возьмите его, в противном случае возведите число в квадрат.

Пример
[4,3,9,7,2,1] -> [2,9,3,49,4,1]
Записи
Входной массив всегда будет содержать только положительные числа и никогда не будет пустым или нулевым.
"""

import math

def square_or_square_root(arr):
    result = []
    for num in arr:
        root = math.sqrt(num)
        if root.is_integer():
            result.append(int(root))
        else:
            result.append(num ** 2)

    return result

print(square_or_square_root([4,3,9,7,2,1]))